Revit 2027 API
FabricationConfiguration.CustomDataExists Method
 Checks to see if the specified custom data exists.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CustomDataExists(
	int customDataId
)
Public Function CustomDataExists (
	customDataId As Integer
) As Boolean
public:
bool CustomDataExists(
	int customDataId
)
member CustomDataExists :
        customDataId : int -> bool
Parameters
customDataId Int32
 The custom data identifier.
Return Value
Boolean
 Returns true if the custom data exists.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace